---
kind: method
id: M:Autodesk.Revit.DB.ExternalResourceBrowserData.IsValidFolderName(System.String)
source: html/b8e9265b-0a7d-d7fd-8588-c49ef5ab5bb2.htm
---
# Autodesk.Revit.DB.ExternalResourceBrowserData.IsValidFolderName Method

Checks whether the folder name is valid.

## Syntax (C#)
```csharp
public bool IsValidFolderName(
	string folderName
)
```

## Parameters
- **folderName** (`System.String`) - The folder name to check.

## Returns
True if the name is a valid folder name, false otherwise.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null